app/controllers/infos_controller.rb

SELECT * FROM "infos"
---
  def index
    @infos = Info.all

SELECT * FROM "infos" WHERE ("infos"."id" = 1)
---
  def show
    @info = Info.find(params[:id])

INSERT INTO "infos" ("created_at", "title", "body", "updated_at") VALUES('2009-09-18 18:34:49', 'Aaaa', 'Aaaaaaa adfasdfsdf', '2009-09-18 18:34:49')
---
  def create
    @info = Info.new(params[:info])
    if @info.save

SELECT * FROM "infos" WHERE ("infos"."id" = 953125641)
---
  def edit
    @info = Info.find(params[:id])

SELECT * FROM "infos" WHERE ("infos"."id" = 953125641)
---
  def update
    @info = Info.find(params[:id])

SELECT * FROM "infos" WHERE ("infos"."id" = 953125641)
DELETE FROM "infos" WHERE "id" = 953125641
---
  def destroy
    @info = Info.find(params[:id])
    @info.destroy