app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-09-18 19:06:27', 'cb8b0945766c2501f33d6745fbb87aafdba190cd5acd60541c1349a14347e6d136671648f3c74c612ae452f68dc60d842f400892522a8ed9ea7fce888a568983', '2009-09-18 19:06:27', 'jonathan', 'b8ViU_432Wjf03E7dMIj', '493fd266b64529912bf6dc1ee90354f0b7175f53570970cca15ccda4683c188d313acab4e798c55c92ce62fead86a88793ba076ad9667eed8331551b02cbc451', 'jonathan@linowes.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "updated_at" = '2009-09-18 19:13:19', "email" = 'lisa@linowes.com' WHERE "id" = 1
---
  def update
    if @user.update_attributes(params[:user])